{
  "http://techcrunch.com/2014/03/20/google-wants-everyone-to-stop-hating-on-glass/": {
    "comments": {
      "paging": {
        "cursors": {
          "after": "OA==", 
          "before": "ODY="
        }
      }, 
      "data": [
        {
          "from": {
            "id": "100007323552642", 
            "name": "Adam Sweet"
          }, 
          "like_count": 42, 
          "can_remove": false, 
          "created_time": "2014-03-20T21:40:19+0000", 
          "message": "When Glass first was released, I was invited to be a \"beta tester\" of the product.  I turned down the $1500 offer.  Recently, I was offered a 2nd time, the price however had increased to $1600 plus tax and shipping.  I turned it down the second time.  \n\nI'm a Google fan and use all the products, but the idea of paying $1600 plus tax and shipping for the honor of beta testing Google's hardware and software is insulting.  Google should pay ME to test the product, not the other way around.﻿", 
          "id": "276634702500349_859803", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "720310060", 
            "name": "Takeshi Young"
          }, 
          "like_count": 31, 
          "can_remove": false, 
          "created_time": "2014-03-20T23:08:52+0000", 
          "message": "\"Google needs to remember that consumers tend to hate everything when it first comes out\"\n\nReally? Did people hate the iPad when it came out? Or the iPhone? Maybe Google needs to accept that most people do not want or need this device, since they already have phones that can do the same things with less of a creep factor. Also, $1500 is way too overpriced for this device.", 
          "id": "276634702500349_859879", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1252441438", 
            "name": "Bob Dana"
          }, 
          "like_count": 14, 
          "can_remove": false, 
          "created_time": "2014-03-21T16:20:00+0000", 
          "message": "In Myth #2: \"So next time you’re tempted to ask an Explorer if he’s recording you, ask yourself if you’d be doing the same with your phone.\"\n\nGoogle is totally missing the point.  If someone is recording me with a phone, I know it.  The answer to the question they pose could be totally different if you have the opportunity to record surreptitiously and I don't.\n\nHonestly, it's totally shocking how tone deaf Google (and some of the media's reporting) is on the subject of the front facing, LED-less camera.\n\nLet me spell it out, Eric:  The only thing wrong with Google Glass is that it makes it too easy to record others without their knowledge or permission.  Fix that, and all these PR issues will go away.  Don't fix it, and no amount of propaganda will stop me (or anyone else with half a brain) from asking Explorers to remove their Glass when they talk to me.\n\nAre you listening?????\n", 
          "id": "276634702500349_860601", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "672363256", 
            "name": "Daen de Leon"
          }, 
          "like_count": 8, 
          "can_remove": false, 
          "created_time": "2014-03-21T01:34:18+0000", 
          "message": "“Almost everybody is reluctant to change almost everything. Whatever you learned as a kid you want to keep always,” Dean Kamen told SXSW attendee Ron Miller who then explained this phenomenon in this post. Kamen, the inventor of the Segway and other things, should understand quite well this early-adopter hate.\n\nQuite true! Just look how useful, cool & widespread the Segway is now!", 
          "id": "276634702500349_860000", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100003099193633", 
            "name": "Nevin Paradise"
          }, 
          "like_count": 7, 
          "can_remove": false, 
          "created_time": "2014-03-22T16:48:28+0000", 
          "message": "Sure go ahead and wear Google Glass as long as all states make the punishment for WWD (wearing while driving) the same as DWI. I drive a motorcycle and have enough concern with idiots texting while driving, which should already be a crime similar to DWI. Now we have to try to distinguish if drivers are wearing eye glasses or Google Glass?  ", 
          "id": "276634702500349_861840", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1532535030", 
            "name": "Pam Raymond"
          }, 
          "like_count": 7, 
          "can_remove": false, 
          "created_time": "2014-03-21T03:55:59+0000", 
          "message": "way to make me hate them more, post a pic of Sarah Jessica Parker wearing some", 
          "id": "276634702500349_860127", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100000276648728", 
            "name": "Brandon Isaacs"
          }, 
          "like_count": 6, 
          "can_remove": false, 
          "created_time": "2014-03-21T01:44:34+0000", 
          "message": "Simply put glass is a revolutionary concept, brought to life. Of course it's not perfect, and I never will be. But they work diligently to improve an already fantastic idea. With specialized apps and proper use this device could open a lot of doors. And I'm not sure what people are finding to be the \"creep\" factor here, but if it's being recorded photographed, maybe you should mosey your way to the back of line with other people stuck in 2000.", 
          "id": "276634702500349_860011", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1367525839", 
            "name": "Chad Knasinski"
          }, 
          "like_count": 6, 
          "can_remove": false, 
          "created_time": "2014-03-20T22:44:52+0000", 
          "message": "Sorry but I would rather pay my mortgage than get Google Glass.  I too turned it down, twice.  When it comes down in price then we can talk.  ", 
          "id": "276634702500349_859863", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "3613650", 
            "name": "Samuel DeFranceschi"
          }, 
          "like_count": 5, 
          "can_remove": false, 
          "created_time": "2014-03-21T04:35:40+0000", 
          "message": "Yea did people hate the TV or Books when they came out? No. Its rude to wear them, and its tantamount to putting your phone in your face while you are walking around. Do you need to wear them? I mean really? You dont. You really do not.. Nor should you wear it when talking to others, or even just at your desk alone, thats why we have normal computers. There comes a time when humans have to say NO to the integration of technology in their lives. This silly google glass IS that line. Google needs to get back to their roots and stick to making gmail better and more secure.", 
          "id": "276634702500349_860166", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "537956281", 
            "name": "Casey Mee"
          }, 
          "like_count": 4, 
          "can_remove": false, 
          "created_time": "2014-03-20T23:41:38+0000", 
          "message": "Hey I know I'm carrying around this really big flame thrower and I'm pointing it right at your children and I know it makes you uncomfortable. But I can also watch Netflix on it so ease off bro.", 
          "id": "276634702500349_859901", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "825035222", 
            "name": "Scott Michael Harris"
          }, 
          "like_count": 3, 
          "can_remove": false, 
          "created_time": "2014-03-22T02:10:36+0000", 
          "message": "Google is terrible an launching new products. I'm not being sarcastic or cynical when I say this - they're just take great services and launch them in the most terrible ways.", 
          "id": "276634702500349_861068", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100000902117815", 
            "name": "Andrei Rotariu"
          }, 
          "like_count": 3, 
          "can_remove": false, 
          "created_time": "2014-03-21T12:22:11+0000", 
          "message": "Please God let someone wear glass next to me so I can kungfu their stupid face back to reality!", 
          "id": "276634702500349_860408", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1492627890", 
            "name": "Emmanuel Pacamalan"
          }, 
          "like_count": 3, 
          "can_remove": false, 
          "created_time": "2014-03-21T00:16:33+0000", 
          "message": "The solution is simple really, remove the camera, problem solved.", 
          "id": "276634702500349_859947", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "511277778", 
            "name": "Collin Dubya"
          }, 
          "like_count": 3, 
          "can_remove": false, 
          "created_time": "2014-03-20T22:42:31+0000", 
          "message": "put a red light on the front when it's recording, problem solved. ", 
          "id": "276634702500349_859861", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100006957990877", 
            "name": "Bruno Del Rio"
          }, 
          "like_count": 2, 
          "can_remove": false, 
          "created_time": "2014-03-21T16:33:42+0000", 
          "message": "it might be cool to wear a pair of google glass, but no one can master the art of Not being a glasshole.  maybe google needs to offer some etiquette advise on \"Don't be a Glasshole.\" ", 
          "id": "276634702500349_860611", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "32902933", 
            "name": "Charles Haggas"
          }, 
          "like_count": 2, 
          "can_remove": false, 
          "created_time": "2014-03-21T05:46:12+0000", 
          "message": "In my view problem is it comes off as way too elitist when our society right now is so anti-elitist. I mean one of the biggest anthems last year was a song about buying your clothes from second hand from a Thrift Shop.", 
          "id": "276634702500349_860203", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1333897745", 
            "name": "Dan DeVos"
          }, 
          "like_count": 2, 
          "can_remove": false, 
          "created_time": "2014-03-20T23:12:15+0000", 
          "message": "I love tech but it's just too creepy. I wouldn't shed any tears if it disappeared into obscurity. It probably won't though and after a while we'll end up getting used to having them around but being able to get used to something doesn't make it a good idea.", 
          "id": "276634702500349_859882", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "577902921", 
            "name": "Jonathan T. Cwiok"
          }, 
          "like_count": 1, 
          "can_remove": false, 
          "created_time": "2014-03-23T04:56:57+0000", 
          "message": "The problem with Google Glass isn't bad PR or privacy, it's the fundamental role of Google Glass as a social media device. Combine augmented reality with Facebook and Twitter and physical socialization becomes completely obsolete. I'm no Luddite, but we have to seriously slow down on inter-connectivity and social media or we'll miss out on all the beauty and adventure that the real world has to offer, however obsolete it may be.\n\nBut to be realistic, of course Google Glass will be accepted over time. Of course augmented reality will become a regular aspect of our existence. Of course most people will waste it on social media and of course the world will become much more boring because of it.", 
          "id": "276634702500349_862405", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "617310474", 
            "name": "Jeremy Toeman"
          }, 
          "like_count": 1, 
          "can_remove": false, 
          "created_time": "2014-03-21T18:29:48+0000", 
          "message": "If Google wants Glass to be \"cool\" they need to retrain the entire world to think people wearing glasses *ever* are cool.  Instead people spend THOUSANDS of dollars to have lasers pointed at their EYES just to NOT have to wear glasses.\n\nMaybe they should try to get the world to think all those people wearing bluetooth headsets in restaurants are also cool?  Oh yeah, that ain't happening either...", 
          "id": "276634702500349_860697", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100000345226234", 
            "name": "Pishabh Badmaash"
          }, 
          "like_count": 1, 
          "can_remove": false, 
          "created_time": "2014-03-23T06:19:31+0000", 
          "message": "They shoulda had a product placement on that women that puked on Lady Gaga.  People woulda killed for the 1st person view of that act of artistry", 
          "id": "276634702500349_862449", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100000209883080", 
            "name": "Jane Smith"
          }, 
          "like_count": 1, 
          "can_remove": false, 
          "created_time": "2014-03-21T21:49:20+0000", 
          "message": "I hope no one here visits Europe because there are cameras recording you literally everywhere in Europe.  But go ahead and scream about \"google glass\" even though most of the time people are most likely not recording you.", 
          "id": "276634702500349_860826", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1355941757", 
            "name": "Gerry Paneda"
          }, 
          "like_count": 1, 
          "can_remove": false, 
          "created_time": "2014-03-21T02:06:43+0000", 
          "message": "The glass just makes people who wear it like bluetooth headsets look like aholes. If they can integrate it to say the users existing glasses through an attachment that can be hidden behind a the head then it looks more natural. But that's why I am poor and they are rich :)", 
          "id": "276634702500349_860029", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1789871198", 
            "name": "Paul Tyrrell"
          }, 
          "like_count": 1, 
          "can_remove": false, 
          "created_time": "2014-03-21T03:53:40+0000", 
          "message": "I would love to try google glass,and wish google the best in the future with this product,i think it will do good for all class of people once the price is cut in half or even less then they might sell more and make something from it", 
          "id": "276634702500349_860126", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100000026151540", 
            "name": "Francisco Mejia"
          }, 
          "like_count": 1, 
          "can_remove": false, 
          "created_time": "2014-03-21T18:20:56+0000", 
          "message": "I wonder how it would be to have radio waves coming out of my head all day. Would have an impact on my brain?\n", 
          "id": "276634702500349_860686", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "637440465", 
            "name": "Miklos Szanyi"
          }, 
          "like_count": 1, 
          "can_remove": false, 
          "created_time": "2014-03-21T05:38:28+0000", 
          "message": "Solution is simple. Make the glass look trendy, not geeky.", 
          "id": "276634702500349_860197", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100004872403673", 
            "name": "Carlos Chang"
          }, 
          "like_count": 1, 
          "can_remove": false, 
          "created_time": "2014-03-21T15:18:01+0000", 
          "message": "Why does google put  glasses on a horse?", 
          "id": "276634702500349_860566", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "652144552", 
            "name": "Gerry Hussein"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T19:52:53+0000", 
          "message": "My take... reposted here for wider view...\n\nIf you are worried about Glass, you have not properly considered drones with cameras yet... a world where we have personal drones flitting about and yes, across your back yard too - and no the government will not be able to stop it happening for any meaningful period of time.\n\nSeriously, 'privacy' is dead, welcome to the new world, where you assume that by default you are either being recorded all the time or are irrelevant in many ways to other people's lives (since so much that we now do of influence has a digital component) - a better world I believe since the main people to truly benefit from 'privacy' in the past were the rich and powerful who could afford to obfuscate their trails to dominance using front-men/women.\n\nThat is now increasingly becoming difficult for to do... In the new world, to be rich and powerful by definition, you have to leave massive trails of recorded interactions on the internet, thus are less private by definition - the new democracy. This balance is not there yet... as a matter of fact there is still a massive imbalance hence the recent NSA security scandals and the fact that hackers and criminals can remain 'anonymous' - it is getting harder for them to cover their tracks...\n\nIt is a change that has been creeping on us a while... and it is the inevitable track of technological progress I happen and others believe too... Google know this already.\n\nRead the recent interview of Kevin Kelly on Edge.org and/or on Wired for more on 'The Technium' and 'Why You Should Embrace Surveillance, Not Fight ' and this perspective spelled out much more eloquently then I have above.... \n\nHere are the links:\n\nThe Technium\nhttp://www.edge.org/conversation/the-technium\n\nWhy You Should Embrace Surveillance, Not Fight It\nhttp://www.wired.com/opinion/2014/03/going-tracked-heres-way-embrace-surveillance/", 
          "id": "276634702500349_863550", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1244304045", 
            "name": "Marji Mattio"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-24T21:19:56+0000", 
          "message": "The creep factor comes in to play when you consider the fact that pedophiles and other less desirable/honorable people take this ridiculous item and use it to record children on a playground, at the beach, etc.  This is a tool that allows them to do their disgusting crime with a little more subtly.  My right to privacy and the right of children to be safe FAR OUTWAYS a total geek's right to have this.  Not to mention the obvious danger of people using while driving, walking down the sidewalk, etc.    Bear in mind, there are many states where recording someone without their permission is ILLEGAL.  Just because someone comes up with new technology, doesn't mean it should be used!", 
          "id": "276634702500349_864842", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100007927542651", 
            "name": "Craig Smith"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-26T18:12:27+0000", 
          "message": "Google's image problem isn't due to these goofy galsses.... it's due to Google's membership in ALEC, which goes counter the their company motto \"Don't be evil\"... \nand those elitist Google buses roaming Silicon Valley aren't helping their image, either.", 
          "id": "276634702500349_867212", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100002002427565", 
            "name": "Artyom Diogtev"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-24T17:00:23+0000", 
          "message": "Yes, it's true - people are reluctant to changes in their life and hence may even hate new things without a good reason but I wouldn't apply it to Google Glass. \n\nI think untill the technology will allow to miniaturize the device to the size that small that people won't be able to distinguish regular prescription / sun glasses from Google Glass the issue with haters and overall public perception will remain on today's level and even worse. I think we should listen careful to what Robert Scoble, one of its best supporters, has to say about it https://plus.google.com/+Scobleizer/posts/RnEhgi3pB2i", 
          "id": "276634702500349_864640", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100007045783935", 
            "name": "Ageyev Nadav"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-26T05:31:12+0000", 
          "message": "Does anyone really think that's positive.that someone comes to you, in front of the face, with a camera., Without asking you???.", 
          "id": "276634702500349_866602", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100002128108643", 
            "name": "Anthony S Burkett"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T08:20:12+0000", 
          "message": "I feel as if they could get a lot more publicity if they'd release glass at a lower price anyways, not to mention the way it's being used... what did they expect? \"Okay glass, take a video.\" sounds creepy in it's own anyways, especially if people are already rejecting the idea.\n\nI'm more curious what could come of the device being rooted. Seriously google glass rooted could open the doors for all kinds of possibilities. \nFor those of you who don't know what \"rooting\" is, a great explanation guide is below.\nhttp://www.techychat.com/2013/02/13/a-guide-to-root/", 
          "id": "276634702500349_861445", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "559049348", 
            "name": "Gerald Becker"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T07:46:58+0000", 
          "message": "I for one love my Glass. Looking forward to alot more integration with my daily business platforms like MS office etc and this will be perfect for on the run. I tend to wear them mostly when on the road/ or in the field. \n\nI can say that the price tag is a little high. Lucky for me my company purchased them for me. All in all I do like the direction Serg is going with this. It still has years to go for maturity. But I am glad I am at the front of this bleeding edge.", 
          "id": "276634702500349_862509", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100000002457294", 
            "name": "John Harper"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-24T14:46:52+0000", 
          "message": "I'm not pro or con Glass but I think they should probably go the industrial and commercial use path and let it work it's way to mass consumers naturally.  As more people work with it on a professional level it will gain acceptance on its own merit.", 
          "id": "276634702500349_864467", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100000055858568", 
            "name": "Samuel Mastronardi"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T16:55:42+0000", 
          "message": "With the research I've done on google glass I have to suspect that their 7th myth is true. According to Google you cannot share this device with anybody or else they will turn it off. This in my eyes means that they are tracking what the individual is doing and does not want any outside contamination of the individual that owns the glass. Other than that it is a very interesting piece of technology.", 
          "id": "276634702500349_861846", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "582506174", 
            "name": "Richard Smart"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T18:52:52+0000", 
          "message": "I'd have thought the problem of charging people $1600 to beta test is that you get a strong skew towards crazed google fans with lots of money who have a preconceived opinion. Better a ballot I'd say - or randomly selecting people themselves, profiling them to ensure they're not just idiots ;o) and then approaching the ones you have left to see if they're interested.", 
          "id": "276634702500349_861944", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1087021328", 
            "name": "Donna Rote"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-26T15:21:20+0000", 
          "message": "Explain it all you want it's still stupid looking and distracting. ", 
          "id": "276634702500349_867050", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100003707803167", 
            "name": "Albert Dennis"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T03:01:27+0000", 
          "message": "Google Glass Looks Like A Great Product But Can Be Deceaving Also And The Price Is Rediculous\nPeople I Talked To About This Product Say They Have No Use Or Interest With Google Glass Maybe\nOne Day We Will And Then Maybe The Price Will Come Down And That Will Depend On Google", 
          "id": "276634702500349_862298", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1355983479", 
            "name": "Antonio P Valero Jr"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-24T04:03:02+0000", 
          "message": "i think its diff, even a little cool. but the price is to high for me. I know if its going to sell the price has to come down a lot. I also think a tester should be payed in some way. not the other away around!!!", 
          "id": "276634702500349_863880", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1670926400", 
            "name": "Richard Grace"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T05:28:09+0000", 
          "message": "...And boy, the marketing their users have done for the project has just been stellar, hasn't it? Just Google \"Bars banning Google Glass\" and Google's SEO-boosted resutls appear along with a lot of... really negative stuff. Crowdsourcing incompetence. Or maybe it's just that the product is doomed. BAD idea.", 
          "id": "276634702500349_861265", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "691583021", 
            "name": "Stephen M Zorio"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-21T13:47:28+0000", 
          "message": "Well, not everyone hates it (shameless self promotion): http://www.scribblelive.com/google-glass-wearable-tech-and-the-future-of-digital-storytelling/", 
          "id": "276634702500349_860503", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "102991", 
            "name": "Tamar Weinberg"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T13:21:12+0000", 
          "message": "I made the argument that at a $1500 price tag, Glass Explorers should also be getting a Chromebook and/or Pixel. I say this after I paid the the $1500+tax for Glass. It's definitely not worth $1500. ", 
          "id": "276634702500349_863132", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1230996289", 
            "name": "Mike Jarvis"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-27T15:05:21+0000", 
          "message": "Tools gotta tool.  Haters gotta hate.", 
          "id": "276634702500349_868126", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "52203750", 
            "name": "Ricky Wainwright"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T18:09:24+0000", 
          "message": "I wish I cared enough about being recorded in public like everybody else here apparently does to really give a shit what some nerd with Glass is doing while I'm around. \n", 
          "id": "276634702500349_863462", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "551375403", 
            "name": "Bjørn Holte"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T23:41:07+0000", 
          "message": "Google have never produced any hardware that has been a success, so get Apple on the ball and I am sure it could work. I got them and they look stupid and function ok.", 
          "id": "276634702500349_863684", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1237441618", 
            "name": "Anju Debnath Voisine"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-21T16:31:59+0000", 
          "message": "Price was too high for average consumers. The whole country is not like Silicon Valley..I'm still surprised how Google missed out on that! I love everything about Google but this was one thing I wasn't impressed about. Google should have done the cost-benefit analysis for themselves and for consumers before they've done all this...", 
          "id": "276634702500349_860609", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1342551776", 
            "name": "Brian Kari"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T05:04:45+0000", 
          "message": "the only problem with the device is, it will ultimately confuse the muscles that control your EYEBALLS and cause major vision problems in the (your) future.  not kidding around.", 
          "id": "276634702500349_862407", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "52203750", 
            "name": "Ricky Wainwright"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T18:10:49+0000", 
          "message": "Remember that these things have 16 gb of storage on them...not exactly enough to waste filming yokels out and about on the town willy-nilly.", 
          "id": "276634702500349_863469", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1626773865", 
            "name": "John Preston"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-20T21:56:40+0000", 
          "message": "Too expensive true dat. Cheaper I'd got one but just like many other devices.. If your not wearing something it would be able to replace then it's a toy..\n\nIn that regard there are haters because of the fear of intrusion and there is just the feel there are haters because it's goofy.\n\nI'm wearing a Sony watch because it's an extension of something I wear.. \n\nNot everyone wears eye stuff so it's goofy.. Um so therefore I'm a hater I guess.  Or am I practical?", 
          "id": "276634702500349_859807", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "503470148", 
            "name": "Joe Murphy"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-26T15:50:14+0000", 
          "message": "Put a Apple symbol on it,  and it will be accepted. ", 
          "id": "276634702500349_867100", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100003705829514", 
            "name": "Michael Suozzi"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T11:42:33+0000", 
          "message": "So why are they discontinuing it if it is so great and all the negatives are myths.\nGimme a break. They can't give this shit away for free.", 
          "id": "276634702500349_862991", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1097185065", 
            "name": "SnapFitness Glen Mills Pa"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T16:24:01+0000", 
          "message": "I won`t even associate with people who have a Bluetooth in their ear, so this is a total\nnon starter. Sorry but you look like a total tool walking around like that.", 
          "id": "276634702500349_861829", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "689847036", 
            "name": "T.j. Rubley"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T02:11:48+0000", 
          "message": "F Glass. Every state should ban it while driving. I don't want to die because someone needs to know what Bieber had for lunch.", 
          "id": "276634702500349_862267", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100000209883080", 
            "name": "Jane Smith"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-21T19:01:43+0000", 
          "message": "I really want it.  Where I live is gorgeous and when I drive I'd love to use HUD to take pix or when my husband is driving - I hate taking out the camera phone to take pix, that would be my usage of it, plus I love having HUD in the car I drive.", 
          "id": "276634702500349_860716", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100000712164889", 
            "name": "Robbie Oberhoff"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-24T08:41:08+0000", 
          "message": "I want Google Glass please Google lol see you in Mountain View in few days lol ", 
          "id": "276634702500349_864120", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "748815701", 
            "name": "Imogen Quigley"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-20T22:54:19+0000", 
          "message": "I agree with Adam Sweet, the price is simply too high to make it viable for the average Joe on the street. The price point needs to match that of the latest Smartphone. I love Google glass, and SJP makes it look awesome. So come on Google make it cheaper and I'll buy it!", 
          "id": "276634702500349_859870", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "689946956", 
            "name": "Peter Antypas"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-21T01:19:19+0000", 
          "message": "Glass is a truly pioneering product which makes it very likely to fail. I also think it's way too ahead of its time in terms of established social norms, so I don't see it crossing the chasm between early adopters and early majority.", 
          "id": "276634702500349_859994", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1417538284", 
            "name": "Ron Hicks"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-21T20:14:42+0000", 
          "message": "If you're really worried about video surveillace go protest at your local shopping mall and yell them to turn there cameras off :-D ", 
          "id": "276634702500349_860778", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "507139924", 
            "name": "Bill Ecker"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T16:28:16+0000", 
          "message": "Google is pushing a product which offers less privacy at a time when people want more privacy.  ", 
          "id": "276634702500349_861830", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "863410273", 
            "name": "Tom Sheahan"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-21T18:31:36+0000", 
          "message": "Google Glass is a cute device. It is like the first mouse. It is not ready for prime time. I see big potential for them! Great Job Google!\n", 
          "id": "276634702500349_860698", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100001665651816", 
            "name": "Brad Thompson"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-20T23:45:30+0000", 
          "message": "I'm not a fan of glass and will never use it. It's intrusive and creepy and there is no re-styling that can stop it from being so. I don't want to be a hipster, never ever ever ever!", 
          "id": "276634702500349_859912", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "508375405", 
            "name": "Tina A. Damouth"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T23:30:53+0000", 
          "message": "These glasses will be the first step into The Unincorporated Man", 
          "id": "276634702500349_862149", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "508764480", 
            "name": "David Nguyen"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T15:41:56+0000", 
          "message": "I love technology and Google but Google glasses feels so narcissistic. ", 
          "id": "276634702500349_861789", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1278700471", 
            "name": "William Andrew Frederick Gailey"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-25T07:48:33+0000", 
          "message": "Cyborgs.....", 
          "id": "276634702500349_865404", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "522445696", 
            "name": "Colton"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-20T22:51:35+0000", 
          "message": "Google should stop making Glass, then.  It will NEVER take off and NEVER become a mainstream thing.  It was ruined before it was even released.", 
          "id": "276634702500349_859869", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1365390434", 
            "name": "Jacqui Garcia-Bowman"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T01:04:02+0000", 
          "message": "Thanks, but no thanks. I don't think I could ever be a Glasshole.", 
          "id": "276634702500349_862211", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1545060381", 
            "name": "Reatha Baker Wilkins"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T21:33:46+0000", 
          "message": "I decided I didn't want a pair, when I saw Sara Palin wearing them.", 
          "id": "276634702500349_862056", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1079721393", 
            "name": "Ed Puydak"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-21T18:00:50+0000", 
          "message": "Segway was also impressive technology and now just a novelty item.", 
          "id": "276634702500349_860673", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1259684827", 
            "name": "Ed Rosi"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T21:54:42+0000", 
          "message": "At around $2,000 of course they want you to like it.", 
          "id": "276634702500349_862066", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100001572901941", 
            "name": "Kc Heller"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T19:11:54+0000", 
          "message": "NOT going to happen.........get over it", 
          "id": "276634702500349_861954", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1830864040", 
            "name": "Gary Doan"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-20T22:11:36+0000", 
          "message": "Just wait, its still vaporware at this point, with no release date, just lots of tease by the press.", 
          "id": "276634702500349_859828", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100002374092079", 
            "name": "Jo Saxby"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-23T02:00:59+0000", 
          "message": "I will gladly pick up a pair for $300-$400.", 
          "id": "276634702500349_862257", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "529769402", 
            "name": "Ray Koren"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T02:07:16+0000", 
          "message": "Myth #1 People actually give a sh!t about Google Glass", 
          "id": "276634702500349_861056", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1241458459", 
            "name": "Franetic Land"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-21T14:12:14+0000", 
          "message": "Is that sarah jessica parker in the picture? Lol famguy", 
          "id": "276634702500349_860517", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100001416094001", 
            "name": "Lawrence Paskaitis"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T23:14:27+0000", 
          "message": "Send me a pair for free and I will try them.", 
          "id": "276634702500349_862133", 
          "user_likes": false
        }, 
        {
          "from": {
            "category": "Community", 
            "name": "Free 20GB cloud storage - copy.com", 
            "id": "139893832887629"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-21T01:16:32+0000", 
          "message": "I really don't see an use for Google Glass. Why should I care?", 
          "id": "276634702500349_859991", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "1010046511", 
            "name": "Phil Young"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T16:48:21+0000", 
          "message": "WHERE AMERICA COMES TO SHOP ONLINE\nGreat Gift Idea’s for family love ones & everyone on your gift list.        \nThis is an easy to use and safe link to top line stores such as MACY’S , BEST BUY , BASS PRO SHOPS ,at  YWMALL.CO & Many more with departments like Beauty and Fashion ,Electronics , Appliances ,Home & Gardens  ,Great items for the kids ,Travel Discounts as well. Many more links at Merchandise items. This is a great time and fuel saver plus you will avoid picked over and crowded retail stores.  No searching for that parking space a mile away from the store. Tell your friends about this link they may thank you because everything you need you can get at this web mall!  Try browsing & shopping now. I think you will love it.\n\n                                              WELCOME! \n                                             YWMALL.CO \n", 
          "id": "276634702500349_861839", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "100002054268825", 
            "name": "Nesto Ipnet"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-22T07:39:11+0000", 
          "message": "Play Sky Bird game on your Android phone! \nGreat casual game for every day!\nhttps://play.google.com/store/apps/details?id=hardcode.skybird", 
          "id": "276634702500349_861420", 
          "user_likes": false
        }, 
        {
          "from": {
            "id": "787681725", 
            "name": "Martin Filtenborg"
          }, 
          "like_count": 0, 
          "can_remove": false, 
          "created_time": "2014-03-25T08:00:28+0000", 
          "message": "How can I hate something I've never had the opportunity to try? Just askin'...", 
          "id": "276634702500349_865409", 
          "user_likes": false
        }
      ]
    }
  }
}